Repository: gulic-desarrollo/gulic-old-repo
Catalog: Traducciones-Drupal-Gulic/sites/all/admin_menu.*.po
Languages: es

source: Administer
es: Administrar

source: Run cron
es: Ejecutar cron

source: Run updates
es: Ejecutar actualizaciones

source: Drupal issue queue
es: Cola de incidencias de Drupal

source: @title issue queue
es: @title cola de incidencias

source: Logout @name
es: Salir @name

source: Add !title
es: Añadir !title

source: Renders the administer menu tree as dropdown menu at the top of the window.
es: Mostrar el árbol del menú de administración como un menú desplegable en la parte alta de la ventana.

source: Current anonymous / authenticated users
es: Usuarios actuales (anónimos/registrados)

source: Administration Menu settings
es: Opciones del menú de administración

source: None
es: Ninguno

source: Weight
es: Peso

source: Parent id
es: Id Padre

source: Display extra information for menu items in Drupal Administration Menu
es: Mostrar información extra en cada entrada del menú de Administración de Drupal

source: If enabled, the chosen information will appear next to each menu item link.
es: Si está activado, la información seleccionada será visible cerca de cada enlace del menú.

source: Display all menu items
es: Mostrar todos los menús

source: Enable this option to disable user access checks for menu items, i.e. every menu item in the visible menu tree will be displayed to every user regardless of access permissions.
es: Active esta opción para desactivar el control de acceso ...

source: Variable editor
es: Editor de Variables

source: Empty cache
es: Caché vacia

source: Administration Menu
es: Menú de Administración

source: Renders a menu tree for administrative purposes as dropdown menu at the top of the window.
es: Muestra un arbol de menús con propósitos administrativos como un desplegable en lo alto de la ventana.

source: Administration
es: Administración
