Repository: gulic-desarrollo/gulic-old-repo
Catalog: Traducciones-Drupal-Gulic/sites/all/autolocale.*.po
Languages: es

source: Automatic import scans all enabled modules and themes for interface translation files under their directories and imports all files found for the selected language. This operation could be resource intensive, and is irreversible.
es: La importación automática rastrea en todos los módulos y temas activos en busca de ficheros de traducción de la interfaz. Si los encuentra, son importados en el módulo para el lenguaje seleccionados. Esta operación consume muchos recursos del sistema y es irreversible.

source: Automatic import
es: Importación Automática

source: No foreign language enabled on your site. You need to <a href="@urladd">add</a> and <a href="@urlenable">enable</a> at least one foreign language to import strings for.
es: No hay ningún idioma extranjero activado en tu sitio. Necesitas <a href="@urladd">añadir</a> y <a href="@urlenable">activar</a> al menos un idioma más para poder importar sus cadenas.

source: Language
es: Idioma

source: Select the language to autoimport translation files into.
es: Selecciona el idioma para autoimportar sus ficheros de traducción dentro.

source: Remove existing translations first
es: Elimine la traducción existente primero

source: It is advised to remove the existing translations in the given language for performance reasons, if you have no custom strings added, which are not available in the PO files to import. This removes strings left from upgrades or previously tried and removed modules.
es: Se recomienda retirar las traducciones en el idioma determinado por razones de rendimiento, si no tiene añadidas cadenas personalizadas,, que no estén disponibles en los archivos PO a importar. Esto elimina cadenas de las actualizaciones o de módulos previamente tratados y eliminados.

source: Perform automatic import
es: Realizar la importación automática

source: Invalid language code (@langcode) choosen for automatic import.
es: Ha elegido un código de idioma no válido (@langcode) para la importación automática.

source: Existing translations removed from @language.
es: Eliminada la traducción para @language.

source: New @language strings imported.
es: Importadas las nuevas cadenas para @language.

source: locale
es: idioma

source: Now you can <a href="@url">import interface translations</a> automatically
es: Ahora usted puede <a href="@url">importar la traducción</a> automáticamente

source: Imported translation file @filename
es: Importado el fichero de traducción @filename

source: Imported %filepath into %langcode.
es: Importando %filepath en %langcode.

source: Automatically imports interface translations.
es: Importación automática de las traducciones de la interfaz.
