Repository: gulic-desarrollo/gulic-old-repo
Catalog: Traducciones-Drupal-Gulic/sites/all/comment_upload.*.po
Languages: es

source: Attachment
es: Adjunto

source: You already have a file uploaded, if you upload another it will overwrite the current one.
es: Acaba de subir un fichero, si vuelve a subir otro fichero, sobreescribirá el primero.

source: File attachments
es: Archivos adjuntos

source: Changes made to the attachments are not permanent until you save this post.
es: Los cambios realizados a los adjuntos no serán permanentes hasta que salve este envio.

source: Attachments on comments
es: Adjuntos en los comentarios

source: Disabled
es: Desactivado

source: Enabled
es: Activado

source: Multiple
es: Múltiple

source: Single
es: Simple

source: Set whether to allow only one attachment per comment
es: Establecer si permite o no un solo adjunto por comentario

source: Images on comments
es: Imágenes en comentarios

source: Normal attachment
es: Adjunto normal

source: Inline display
es: Mostrado Inline

source: Show uploaded image with comment or use a normal attachment link (single attachment mode only)
es: Mostrar la imagen que ha subido con comentarios o usar un enlace normal (únicamente en modo adjunto único)

source: Comment upload
es: Comentario actualizado

source: Allows users to attach files to comments.
es: Permitir a los usuarios añadir comentarios a los ficheros.
