Repository: gulic-desarrollo/gulic-old-repo
Catalog: Traducciones-Drupal-Gulic/sites/all/forward.*.po
Languages: es

source: Send an e-Postcard
es: envía una tarjeta postal

source: Administrative Options
es: Opciones administrativas

source: Use Node Type in Link
es: Usa el tipo de nodo en el vínculo

source: If checked, the link will read &quot;email this <em>nodetype</em>&quot;; if not, it will just read &quot;email this page&quot;
es: Si esta opción es elegida, el vínculo se verá como &quot; envía esta <em>nodetype</em>&quot;; si no, el vínculo solo se leera como &quot; envía esta página &quot;

source: Form Type
es: Tipo "forma"

source: Select link for a forward this page link or form to use a collapsible forwarding form.
es: Seleccione para tener un vínculo de envía esta página o para tener una forma colapsible

source: Flood Control Limit
es: Límite para evitar "inundaciones" de spamers

source: How many times a user can use the form in a one hour period. This will help prevent the forward module from being used for spamming.
es: Cuantas veces un usuario puede usar una forma dentro de un periodo de una hora. Esto prevendrá que el módulo sea usado para enviar spam.

source: Flood Control Error
es: Error en el control de "inundaciones"

source: This text appears if a user exceeds the flood control limit. The value of the flood control limit setting will appear in place of %number in the message presented to users
es: Este texto aparece cuando el usuario excede el límite de control de inundaciones. El valor de límite de control de inundaciones aparecerá en luar de %number en el mensaje mostrado a los usuarios

source: Page Text Values
es: Valores de la página de texto

source: Forward Instructions
es: Instrucciones para los envíos

source: Thank you for your interest in spreading the word on
es: Gracias por su interes en

source: NOTE: We only request your email address so that the person you are recommending the page to knows that you wanted them to see it, and that it is not junk mail. We do not capture any email address.
es: Nota: Utilizamos su correo electrónico únicamente para ponerlo en el remitente de los envíos que haga a sus amigos. No registraremos ninguna de las direcciones de correo.

source: This message will be displayed above the form.
es: Este mensaje será mostrado en la parte de arriba de la forma.

source: Thank You Message
es: Gracias por su mensaje

source: Thank you for your help in spreading the word about
es: Gracias por su interés en

source: We appreciate your help.
es: Apreciamos su ayuda

source: This message will be displayed after the user successfully submits the form.
es: Este mensaje será mostrado despues de que el usuario haya enviado su mensaje.

source: From Address
es: Dirección del remitente

source: The address to send from. Should be a functioning email address.
es: Esta direccion de correo es la del remitente. Deberá de ser una dirección que esté en funcionamiento

source: Header Image for Email
es: Imágen para el encabezado del mensaje

source: Enter the URL of the image to as a logo at the top of forwarded pages.
es: Escriba el URL del logo que estará en la parte de arriba de los mensajes

source: Forward Message Subject
es: Asunto del envío

source: Forward Message Body
es: Cuerpo del envío

source: e-Postcard Message Subject
es: Asunto de la tarjeta postal

source: e-Postcard Message Body
es: Cuerpo del mensaje de la tarjeta postal

source: Oranization Ad
es: Anuncio de la organización

source: This message will be just above the footer message in the email.
es: Este mensaje será puesto arriba del pié de página en el envío

source: Footer Message
es: Mensaje del pié de página

source: This message will be postpended as a footer message to the email.
es: Este mensaje será adicionado como el pié de página

source: Latest Blog Articles
es: Últimas entradas en el blog

source: Latest Users
es: Últimos usuarios registrados

source: Latest Comments
es: Últimos comentarios

source: Most Popular Content
es: Contenido mas popular

source: None
es: Ninguno

source: Dynamic Block
es: Bloque dinámico

source: Choose the dynamic block to send with these emails
es: Escoja el bloque dinámico que será enviado junto con los mensajes de correo eletrcónico

source: Forward this page to a friend
es: Envíar esta página a un amigo

source: Your Email
es: Su correo electrónico

source: Your Name
es: Su nombre

source: Send To
es: Enviar a

source: Enter multiple addresses on separate lines or separate them with commas.
es: Escriba las direcciones de correo. Solamente una por linea

source: Message Subject
es: Asunto del mensaje

source: (Your Name)
es: (Su nombre)

source: Message Body
es: Cuerpo del mensaje

source: Your Personal Message
es: Su mensaje personal

source: Send Message
es: Enviar mensaje

source: You can't send more than %number messages per hour. Please try again later.
es: Usted no puede enviar mas de %number mensajes por hora. Por favor intentelo mas tarde

source: Header injection attempt detected. Do not enter line feed characters into the from field!
es: Se detectó una injección de encabezado! No trate de escribir caracteres extraños en el campo "de"

source: Your Email address is invalid.
es: Su dirección de correo es inválida

source: You must enter your name.
es: Debe de escribir un nombre

source: You did not enter any recipients.
es: No escribío ningún destinatario

source: One of your Recipient addresses is invalid:
es: Uno de sus destinatarios es inválido:

source: You must enter a message.
es: Debe de escribir un mensaje

source: Recent blog posts
es: Entradas recientes en el blog

source: Who's new
es: Usuarios nuevos

source: Recent comments
es: Comentarios recientes

source: page
es: página

source: Time
es: Hora

source: Type
es: Tipo

source: Path
es: Ruta

source: Title
es: Título

source: emails sent to
es: enviar mensajes a

source: recipients
es: destinatarios

source: No one has used Forward yet.
es: No ha usado Forward todavía

source: Forward Tracking
es: Seguimiento de Envios (Forward)

source: Most Emailed
es: Mas enviados

source: Most Emailed Today
es: Mas enviados hoy

source: Most Emailed This Week
es: Mas enviados esta semana

source: Most Emailed of All Time
es: Mas enviados en todos los tiempos

source: Most Recently Emailed
es: Mas recientemente enviados

source: Block Type
es: Bloque tipo

source: Choose the block type
es: Seleccione otro tipo de bloque

source: Today's Most Emailed
es: Más enviados hoy

source: This Week's Most Emailed
es: Más enviados esta semana

source: Message from Sender
es: Mensaje del remitente

source: Click here to read more on our site
es: Haga click aquí para leer mas sobre nuestro sitio

source: Click here to visit our site
es: Haga click aquí para visitar nuestro sitio

source: Forward module installed tables successfully.
es: Módulo de envío (Forward) ha instalado sus tablas correctamente
