Repository: gulic-desarrollo/gulic-old-repo
Catalog: Traducciones-Drupal-Gulic/sites/all/register_validation.*.po
Languages: es

source: <p>The Register Validation module provides a mechanism to validate the username entered by new users in the registration form.</p>
es: <p>El módulo Register Validation proporciona un mecanismo para validar el nombre de usuario introducido por los nuevos usuarios en el formulario de registro.</p>

source: Register form validation
es: Validación del formulario de registro

source: Configure register form validation options.
es: Configurar las opciones de validación del formulario de registro

source: Username restrictions
es: Restricciones en el nombre de usuario

source: Configure the rules to restrict the valid usernames for new accounts.
es: Configurar las reglas para restringir los nombres de usuario válidos para las nuevas cuentas.

source: Regular expression
es: Expresión regular

source: Perl Compatible Regular Expression to check the username.
es: Expresión regular compatible Perl (PCRE) para comprobar el nombre de usuario.

source: Invalid usernames
es: Nombres de usuario inválidos

source: List of usernames to avoid in new accounts. Supports regular expressions e.g. /^anon.*$/i
es: Lista de nombres de usuario a evitar en las nuevas cuentas. Admite expresiones regulares, como por ejemplo /^anon.*$/i

source: The configuration options have been saved.
es: Se han guardado las opciones de configuración.

source: The configuration options have been reset to their default values.
es: Se han restablecido los valores predefinidos de las opciones de configuración.

source: You must enter a username.
es: Debe ingresar un nombre de usuario.

source: The username cannot begin with a space.
es: El nombre del usuario no puede comenzar con un espacio.

source: The username cannot end with a space.
es: El nombre del usuario no puede finalizar con un espacio.

source: The username is not a valid authentication ID.
es: El nombre del usuario no es un id. de autenticación válido.

source: The username %name is too long: it must be %max characters or less.
es: El nombre del usuario %name es demasiado largo. Debe tener %max caracteres o menos.

source: Register Validation
es: Validación del Registro

source: Implements some validation rules in registration form.
es: Implementa algunas reglas de validación en el formulario de registro.
