Repository: gulic-desarrollo/gulic-old-repo
Catalog: ldap_provisioning/po/*.po
Languages: es

source: Remarks
es: Comentarios

source: Additional registration remarks.
es: Inscripción adicional de comentarios

source: Implements LDAP users provisioning.
es: Implementa el suministro de usuarios LDAP

source: Configure LDAP Provisioning settings
es: Configura parámetros de LDAP Provisioning

source: validate
es: validar

source: Account management
es: Gestión de cuentas

source: List all pending account requests and let create new accounts.
es: Listar todas las cuentas pendientes y permitir crear nuevas cuentas

source: Pending
es: Pendiente

source: Rejected
es: Rechzada

source: Unverified
es: Sin verificar

source: New
es: Nueva

source: Batch upload file template
es: Cargar lote de ficheros con plantillas

source: Invites
es: Invitar

source: Invite contact
es: Contacto invitado

source: Manage invites
es: Gestionar invitados

source: Invite autocomplete
es: Autocompletar invitado

source: User deletion: user data could not be read in the LDAP directory. Could not bind as %dn.
es: Borrado de usuario: los datos de usuario no pueden ser leidos del directorio LDAP. Imposible conectar como %dn.

source: The user %username has not been deleted from the LDAP directory.
es: El usuario %username no ha sido eliminado del directorio LDAP.

source: User deletion: user %username has been deleted from the LDAP directory.
es: Borrado de usuario: el usuario %username ha sido borrado del directorio LDAP.

source: User deletion: user %username has not been deleted from the LDAP directory.
es: Borrado de usuario: el usuario %username no ha sido borrado del directorio LDAP.

source: User deletion: user %username is not found in LDAP directory.
es: Borrado de usuario: el usuario %username no ha sido encontrado en el directorio LDAP.

source: Account deletion notification e-mail mailed to %username at %mail.
es: El email de notificación de borrado ha sido enviado a %username en %mail.

source: Error mailing account deletion notification to %username at %mail.
es: Error enviando la notificación de borrado a %username en %mail.

source: User validate: user data could not be read in the LDAP directory. Could not bind as %dn.
es: Validación de usuario: los datos de usuario no se pueden leer en el directorio LDAP. Imposible contectar como %dn.

source: The DN %name is already taken in LDAP.
es: El DN %name ya está cogido en LDAP.

source: User update: user data could not be read in the LDAP directory. Could not bind as %dn.
es: Actualización de usuario: los datos de usuario no se pueden leer en el directorio LDAP. Imposible conectar como %dn.

source: User update: user data could not be read in the LDAP directory. Please contact site administrator.
es: Actualización de usuario: los datos de usuario no se pueden leer en el directorio LDAP. Por favor, contacte con el administrador del sitio.

source: User update: user ldap entry cannot be renamed.
es: Actualización de usuario: la entrada ldap del usuario no se puede renombrar.

source: Enable LDAP user provisioning
es: Activar LDAP Provisioning

source: Custom username
es: Nombre de usuario personalizado

source: Allow to choose custom username in the registration form.
es: Permitir personalizar el nombre de usuario en el formulario de registro.

source: Username template
es: Plantilla de nombre de usuario

source: Customize the username.
es: Personalizar el nombre de usuario.

source: first name
es: nombre

source: first letter of first name, etc
es: primera letra del nombre, etc

source: last name
es: apellido

source: first two letters of last name, etc
es: primeras dos letras del apellido, etc

source: Use captcha in the registration form.
es: Usar captcha en el formulario de registro.

source: Enable debugging
es: Activar depurado

source: The LDIF entry will be print on the screen for configuration debugging.
es: La entrada LDIF será mostrada en la pantalla para el depurado de la configuración.

source: Registration form
es: Formulario de registro

source: Use profile fields in the registration form
es: Usar campos del perfil en el formulario de registro

source: Profile fields are shown on the registration form according to their setup in the profile.
es: Los campos del perfil serán mostrados en el formulario de registro de acuerdo a su configuración en el perfil.

source: Profile first name
es: Nombre en el perfil

source: Profile field associated with the user's firt name. When the field is set and custom usernames are not allowed, this field will be used to construct a username.
es: Campo de perfil asociado con el nombre del usuario. Cuando el campo esté establecido y no se permitan los nombres de usuario personalizados, éste será usado para construir un nombre de usuario.

source: Profile last name
es: Apellido en el perfil

source: Profile field associated with the user's last name. When the field is set and custom usernames are not allowed, this field will be used to construct a username.
es: Campo del perfil asociado con el apellido del usuario. Cuando el campo esté establecido y no se permitan los nombres de usuario personalizados, éste será usado para construir el nombre de usuario.

source: LDAP server
es: Servidor LDAP

source: Select LDAP server to create LDAP accounts in.
es: Seleccionar servidor LDAP para crear cuents LDAP en él.

source: Bind DN should have the rights to create new LDAP entries.
es: Bind DN debería tener permisos para crear una nueva entrada LDAP.

source: Clear current password
es: Limpiar contraseña actual

source: Choose which attributes to show on the registration form:
es: Elegir qué atributos mostrar en el formulario de registro:

source: Basic LDAP attributes
es: Atributos de LDAP básicos

source: Customize the rest LDAP attributes in LDIF style.
es: Personalizar el resto de atributos LDAP en el LDIF.

source: Empty lines and lines starting with "#" will be ignored.
es: Líneas vacías y líneas que empiecen con "#" serán ignoradas.

source: E-mail notification
es: Notificación E-mail

source: Subject of validate e-mail
es: Asunto de e-mail de validación

source: Customize the subject of your request validate e-mail message, which is sent to new members upon registering.
es: Personalizar el asunto de la petición del mensaje de validación, que será enviada a los nuevos miembros que se registren.

source: Body of validate e-mail
es: Contenido del e-mail de validación

source: Customize the body of your request validate e-mail message, which is sent to new members upon registering.
es: Personalizar el contenido de la petición del mensaje de validación, que será enviado a los nuevos miembros que se registren.

source: Subject of notify e-mail
es: Asunto del e-mail de notificación

source: Customize the subject of your account manager notification e-mail message.
es: Personalizar el asunto del mensaje de notificación gestor de cuentas

source: Body of notify e-mail
es: Contenido del e-mail de notificación

source: Customize the body of your account manager notification e-mail message.
es: Personalizar el contenido del e-mail de notificación de gestión de cuentas.

source: Subject of reject e-mail
es: Asunto del e-mail de rechazo

source: Customize the subject of your request reject e-mail message.
es: Personalizar el asunto de la petición de e-mail de rechazo.

source: Body of reject e-mail
es: Contenido del e-mail de rechazo

source: Customize the body of your request reject e-mail message.
es: Personalizar el contenido de la petición de e-mail de rechazo.

source: Subject of creation e-mail
es: Asunto del e-mail de creación

source: Customize the subject of new account creation notification e-mail message.
es: Personalizar el asunto de notificación para la creación de una nueva cuenta.

source: Body of creation e-mail
es: Contenido del e-mail de creación

source: Customize the body of new account creation notification e-mail message.
es: Personalizar el contenido de notificación para la creación de una nueva cuenta.

source: Subject of deletion e-mail
es: Asunto del e-mail de eliminación

source: Customize the subject of the account deletion notification e-mail message.
es: Personalizar el asunto de la notificación para la eliminación de una cuenta.

source: Body of deletion e-mail
es: Contenido del e-mail de eliminación

source: Customize the body of the account deletion notification e-mail message.
es: Personalizar el contenido de la notificación para la eliminación de una cuenta.

source: Allow invites
es: Permitir invitados

source: Invites should be used only when "Account approval" is set to required.
es: Invitados deberían ser usados cuando se requiera "Aprobación de cuenta".

source: "From" e-mail address
es: Dirección de e-mail "De"

source: Site
es: Sitio

source: Inviter
es: Invitador

source: Choose which e-mail address will be in the From: header for the invitation mails sent. <em>Site</em> will use the default e-mail address of the site, whereas <em>Inviter</em> will use the e-mail address of the person who is sending the invitation.
es: Seleccionar qué dirección e-mail estará en la cabecera De: para las invitaciones enviadas. El <em>sitio</em> usará la dirección e-mail por defecto del sitio, donde el <em>invitador</em> será la dirección de la persona quién esté mandando la invitación.

source: Subject of invite e-mail
es: Asunto del e-mail de invitación

source: Customize the subject of your invite e-mail message.
es: Personalizar el asunto del e-mail de invitación.

source: Body of invite e-mail
es: Contenido del email de invitación

source: Customize the body of your invite e-mail message.
es: Personalizar el contenido del e-mail de invitación.

source: Profile field %s is not found.
es: No se encuentra el campo %s en el perfil.

source: Profile field %s should be configured as "
es: El campo %s del perfil debería ser configurado como "

source: Visible in user registration form
es: Visible en el formulario de registro de usuario

source: " and "
es: " y "

source: The user must enter a value
es: El usuario debe introducir un valor

source: If profile first name is set, the last name should be set as well.
es: Si el nombre está definido en el perfil, el apellido también debería estarlo.

source: If profile last name is set, the first name should be set as well.
es: Si el apellido está definido en el perfil, el nombre también debería estarlo.

source: Request new account
es: Solicitar nueva cuenta

source: The code %s has already been validated.
es: El código %s ya ha sido validado.

source: The code %s is not valid or has expired.
es: El código %s no es válido o ha expirado.

source: First Name
es: Nombre

source: Last Name
es: Apellido

source: Username cannot begin with a space.
es: El nombre de usuario no puede empezar con espacio.

source: Username cannot end with a space.
es: El nombre de usuario no puede terminar con espacio.

source: Username should contain only letters, numbers and spaces.
es: El nombre de usuario sólo debería contener letras, números y espacios.

source: The username %s is already taken. Please choose different one.
es: El nombre de usuario %s ya está cogido. Por favor, elija otro.

source: User validate: user data could not be read in the LDAP directory. Please contact site administrator.
es: Validación de usuario: los datos de usuario no se pueden leer en el directorio LDAP. Por favor, contacte con el administrador del sitio.

source: The e-mail address %s is not valid.
es: La dirección e-mail %s no es válida.

source: The user with e-mail address %s is already registered with the system. Click
es: El usuario con la dirección e-mail %s ya está registrado en el sistema. Haga click

source: if you forgot your login information.
es: si has olvidado los datos de acceso.

source: First Name cannot begin with a space.
es: El nombre no puede empezar con espacio.

source: First Name cannot end with a space.
es: El nombre no puede terminar con espacio.

source: First Name should contain only latin letters, apostrophe, dash or space.
es: El nombre sólo debería contener caracteres latinos, apóstrofe, quión o espacio.

source: Last Name cannot begin with a space.
es: El apellido no puede empezar con espacio.

source: Last Name cannot end with a space.
es: El apellido no puede terminar con espacio.

source: Last Name should contain only latin letters, apostrophe, dash or space.
es: El apellido sólo debería contener caracteres latinos, apóstrofe, guión o espacio.

source: First Name can not contain only whitespace characters.
es: El nombre no puede contener sólo espacios.

source: Last Name can not contain only whitespace characters.
es: El apellido no puede contener sólo espacios.

source: Your account has been created. Login information and further instructions have been sent to your e-mail address.
es: Su cuenta ha sido creada. Los datos de acceso e instrucciones adicionales han sido enviadas a su dirección de correo electrónico.

source: The new user was not created. Please contact site administrator.
es: El nuevo usuario no ha sido creado. Por favor, contacte con el administrador del sitio.

source: E-mail validation request mailed to %first_name %last_name at %mail.
es: Petición de correo de validación enviada a %first_name %last_name en %mail.

source: An e-mail has been sent to the e-mail account %s to verify that you have entered a valid e-mail address.
es: Un mensaje ha sido enviado a %s para verificar que ha introducido una dirección de correo electrónico válida.

source: Error mailing e-mail validation request to %first_name %last_name at %mail.
es: Error enviando la petición de validación a %first_name %last_name en %mail.

source: Please check your e-mail and click the link in the message to confirm your address. If you are unable to click the link, you can copy the secret code from the e-mail and enter it below.
es: Por favor, compruebe su buzón de correo y haga click en el enlace del mensaje para confirmar su dirección. Si es incapaz de hacer click en el enlace, puede copiar el código secreto del e-mail e introducirlo abajo.

source: Secret Code
es: Código Secreto

source: The code %s is not valid.
es: El código %s no es válido.

source: E-mail notification message about %first_name %last_name account request mailed to %mail.
es: Mensaje de notificación sobre la cuenta %first_name %last_name enviado a %mail.

source: Error mailing notification e-mail about %first_name %last_name account request mailed to %mail.
es: Error enviando mensaje de notificación de %first_name %last_name en %mail.

source: Your e-mail account %mail has been validated. Please wait until your account is approved. You will receive login information to your e-mail account.
es: Su cuenta de correo electrónico %mail ha sido validada. Por favor, espere hasta que su cuenta sea aprobada. Recibirá los datos de acceso correspondientes en su cuenta de correo.

source: Create the selected users
es: Crear usuarios seleccionados

source: Reject the selected users
es: Rechazar usuarios seleccionados

source: Submission Date
es: Fecha de envío

source: E-Mail
es: Correo electrónico

source: Approval Date
es: Fecha de aprobación

source: Approver
es: Moderador

source: Account
es: Cuenta

source: No entries
es: Sin entradas

source: No entries available.
es: Sin entradas disponibles.

source: User with an e-mail address %s was not created. Please, create it manually.
es: El usuario con la dirección de correo %s no ha sido creado. Por favor, créela manualmente.

source: The new user
es: El nuevo usuario

source: has been created.
es: ha sido creado.

source: Reject account
es: Rechazar cuenta

source: Save notes
es: Guardar notas

source: The notes have been saved.
es: Las notas han sido guardadas.

source: The user receives the combined permissions of the %au role, and all roles selected here.
es: El usuario recibirá los permisos combinados del rol %au y de los roles seleccionados aquí.

source: Messages
es: Mensajes

source: This message will be added to the notification e-mail sent out.
es: Este mensaje será añadido al e-mail de notificación enviado.

source: Notes
es: Notas

source: Internal notes shared between account managers.
es: Notas internas compartidas entre administradores de cuentas.

source: The request was rejected at %date by
es: La petición fue rechazada el %date por

source: The request was processed at %date by
es: La petición fue procesada el %date por

source: The created username is
es: El nombre de usuario creado es

source: The account was deleted at %date by
es: La cuenta fue eliminada el %date por

source: An account with a username %u and e-mail %e is already created in the system. If you proceed, a new account will be created with a number appended to the username.
es: Una cuenta con un nombre de usuario %u y un e-mail %e ya ha sido creada en el sistema. Si procede, una nueva cuenta será creada con un número añadido al nombre de usuario.

source: User registration: user data could not be read in the LDAP directory. Could not bind as %dn.
es: Registro de usuarios: los datos de usuario no se pueden leer en el directorio LDAP. Imposible acceder como %dn.

source: User registration: user data could not be read in the LDAP directory. Please contact site administrator.
es: Registro de usuarios: los datos de usuario no se pueden leer en el directorio LDAP. Por favor, contacte con el administrador.

source: Invite a contact to the site or add a user to your buddy list
es: Invitar contacto al sitio o añadir un usuario a la lista de amigos

source: Invite a contact to the site
es: Invitar contacto al sitio

source: Type the e-mail of the person you would like to invite to the site or type username or e-mail of the existing user you would like to add to your buddy list.
es: Escriba el e-mail de la persona que desea invitar al sitio o, el nombre de usuario o e-mail del usuario existente que desea añadir a su lista de amigos.

source: Type the e-mail of the person you would like to invite to the site.
es: Escriba el e-mail de la persona que desea invitar al sitio.

source: Your message
es: Su mensaje

source: This message will be added to the e-mail sent to the person you are inviting to the site.
es: Este mensaje será añadido al e-mail enviado a la persona que está invitando al sitio.

source: Add to my buddy list
es: Añadir a mi lista de amigos

source: Check this if you would like that your invited to the site contact would receive a request to add you to his buddy list.
es: Seleccionar si desea que su contacto invitado reciba una petición para añadirse a su lista de amigos.

source: Check this if you would like that your invited to the site contact would be automatically added to your buddy list.
es: Seleccionar si desea que su contacto invitado sea automáticamente a su lista de amigos.

source: The invitation already was sent to user with e-mail address %s.
es: La invitación ya ha sido enviada al usuario con e-mail %s.

source: The user %u with the e-mail address %s is already in your buddy list.
es: El usuario %u con el e-mail %s ya está en su lista de amigos.

source: The request to add user %u with the e-mail address %s to your buddy list has already been submitted.
es: La petición para añadir al usuario %u con el e-mail %s a su lista de amigos ya ha sido enviada.

source: The user %u with the e-mail address %s has already requested you to add him/her to your buddy list. Go to "your invites" tab to process the request.
es: El usuario %u con e-mail %s ya le ha pedido añadirse a su lista de amigos. Ir a la pestaña "sus invitados" para procesar la petición.

source: The user %u with e-mail address %s is already registered with the system.
es: El usuario %u con e-mail %s ya ha sido registrado en el sistema.

source: Your request to add %s to your buddy list has been submitted. %s will be notified.
es: Su petición para añadir a %s a su lista de amigos ha sido enviada. %s será notificado.

source: %s has been added to your buddy list. %s will be notified the next time s/he logs in.
es: %s ha sido añadido a su lista de amigos. %s será notificado la próxima vez que inicie sesión.

source: Invite e-mail was maild to %mail.
es: La invitación fue enviada a %mail.

source: The invite has been mailed to e-mail address %s.
es: La invitación ha sido enviada a %s

source: Error mailing invite e-mail to %mail.
es: Error enviando la invitación a %mail

source: Sent
es: Enviado

source: Add to buddy list
es: Añadir a lista de amigos

source: Action
es: Acción

source: Joined
es: Unido

source: View account
es: Ver cuenta

source: Delete invitation
es: Borrar invitación

source: No invites
es: Sin invitaciones

source: The invitation to %s has been deleted.
es: La invitación a %s ha sido eliminada.

source: Unable to delete the invite.
es: Imposible eliminar la invitación.

source: User creation: user data could not be read in the LDAP directory. Could not bind as %dn.
es: Creación de usuarios: los datos de usuario se pueden leer en el directorio LDAP. Imposible acceder con %dn.

source: Error! User data could not be read in the LDAP directory. Please contact site administrator.
es: ¡Error! Los datos de usuaario no se pueden leer en el directorio LDAP. Por favor, contacte con el administrador del sitio.

source: Account creation notification e-mail mailed to %username at %mail.
es: Mensaje de creación de cuenta enviado a la cuenta %mail del usuario %username.

source: Error mailing account creation notification to %username at %mail.
es: Error enviando mensaje de creación de cuenta a %mail del usuario %username.

source: User creation: user was not created in the LDAP directory.
es: Creación de usuarios: el usuario no fue creado en el directorio LDAP.

source: The account request for %first %last (%mail) has been rejected.
es: La petición de cuenta para %first %last (%mail) ha sido rechazada.

source: E-mail rejection message mailed to %first_name %last_name at %mail.
es: Mensaje de rechazo ha sido enviado a %mail de %first_name %last_name.

source: Error mailing rejection e-mail to %first_name %last_name at %mail.
es: Error enviando mensaje de rechazo a %mail de %first_name %last_name.

source: Validate your e-mail at %site
es: Validar su e-mail en %site

source: %first_name %last_name, Thank you for registering at %site. You may now validate your e-mail address by entering the code %code at %validate_uri (by copying and pasting). You may also validate the e-mail by clicking on this link or copying and pasting it in your browser: %validate_url -- %site team
es: %first_name %last_name, Gracias por registrarse en %site. Ahora puede validar su dirección de correo electrónico introduciendo el código %code en %validate_uri (copiando y pegando). Además puede validar su dirección de correo haciendo click en el siguiente enlace o copiándolo y pegándolo en su navegador: %validate_url -- El equipo %site

source: Your request at %site has been rejected
es: Su petición en %site ha sido rechazada

source: %first_name %last_name, Sorry, but your account request at %site has been rejected. Please resubmit the registration form with more information. ----- %message -- %site team
es: %first_name %last_name, Lo sentimos, pero su petición de cuenta en %site ha sido rechazada. Por favor, reintente el proceso con más información. ----- %message -- El equipo %site

source: New account request at %site
es: Nueva petición de cuenta en %site

source: %first_name %last_name (%mail) has requested the account at %site. Click this link %create_url to process the request.
es: %first_name %last_name (%mail) ha pedido una cuenta en %site. Haga click en este enlace %create_url para procesar la petición.

source: The account has been created for you at %site
es: Su cuenta has ido creada en %site
