Repository: gulic-desarrollo/gulic-old-repo
Catalog: ldap_provisioning/po/*.po
Languages: es

source: %first_name %last_name, The account at %site has been created for you. You may now log in to %login_uri using the following username and password: username: %username password: %password You may also log in by clicking on this link or copying and pasting it in your browser: %login_url This is a one-time login, so it can be used only once. ----- %message -- %site team
es: %first_name %last_name, Su cuenta ha sido creada en %site. Ahora puede identificarse en %login_uri usando el siguiente nombre de usuario y contraseña: Nombre de usuario: %username Contraseña: %password Además puede identificarse haciendo click en este enlace o copiándolo y pegándolo en su navegador: %login_url Este es un acceso de un solo uso, así que sólo puede usarlo una vez. ----- %message -- El equipo %site

source: Your account has been deleted at %site
es: Su cuenta ha sido eliminada de %site

source: %first_name %last_name, Your account %username has been deleted at %site. -- %site team
es: %first_name %last_name, Sucuenta como %username ha sido eliminada de %site. -- El equipo %site

source: You have been invited to the %site
es: Has sido invitado a %site

source: Your friend, %name has invited you to join %site site. You may now register to the site at %register_uri ---------- %message -- %site team
es: Su amigo, %name le ha invitado a unirse a %site. Puede registrarse ahora en %register_uri ---------- %message -- El equipo %site

source: Upload accounts
es: Cargar cuentas

source: Users data in xml or csv format. Click
es: Datos de usuario en formato xml o csv. Haga click

source: or
es: o

source: to download the templates.
es: para descargar las plantillas.

source: There is no file attached.
es: No hay ficheros añadidos.

source: Users data in xml or csv format.
es: Datos de usuario en formato xml o csv.

source: The users data from the file '%f' has been uploaded.
es: Los datos de usuario del archivo '%f' han sido cargados.

source: in file '%f'.
es: en el archivo '%f'.

source: File '%f' has unsupported extension '%e'.
es: El archivo '%f' tiene una extensión '%e' no soportada.

source: First name
es: Nombre

source: (required)
es: (requerido)

source: Last name
es: Apellido

source: XML error: %s at line %d
es: Error XML: %s en la línea %d

source: GULiC's Hacks to LDAP Provisioning
es: Hack de GULiC a LDAP Provisioning

source: Implements some hacks to the LDAP Provisioning module.
es: Implementa algunos hacks al módulo LDAP Provisioning.
