Repository: gulic-desarrollo/gulic-old-repo
Catalog: Traducciones-Drupal-Gulic/sites/all/event/contrib.*.po
Languages: es

source: An event is a story which can be given a start and end date, thus appearing in the events calendar.
es: Un evento es una historia que puede tener una fecha de comienzo y de fin, entonces aparecer en el calendario de los eventos.

source: event content-type settings page
es: La pagína de los parámetros del contenido tipo del evento

source: Title
es: Título

source: Body
es: Cuerpo

source: <p>The Event Views module makes the event fields available to the Views module, and creates default event views that filter dates using a drop-down date selector, the jscalendar selector, or by arguments in the url. Set up a default event view by going to %link and select <strong>add</strong>. Save the default views as-is or make any changes you like.</p>
es: <p>El módulo Event Views rende los campos de eventos disponibles para el módulo Views y crea vistas de evento por defecto que filtra las fechas usando un selector de fecha desenrollando, el selecdor jscalendor o con los parámetros en la URL. Establece una vista por defecto de los eventos consultando %link y seleccionando <strong>añadir</strong>. Guarda las vistas por defecto como tal, o haga los cambios necessitados.</p>

source: <p>You can change the format of the output. The default views display a list of events, but you can change it to a table or a teaser list in the <strong>Page</strong> settings. You can also add or remove fields from the view.</p>
es: <p>Se puede cambiar el formato de la salida. La vista preliminar mostra una lista de los eventos, pero usted la puede reemplazar por una table o en una lista resumida en la <strong>Página</strong> de los parámetros. Campos se pueden también añadir o suprimir de la vista.</p>

source: <p>You can filter events in several ways. Use filters to pre-select a date range, expose those filters to allow the viewer to select a date range, or eliminate the filters and give the view year, month, and day arguments to filter the events by the url (i.e. YYYY/MM/DD).</p>
es: <p>Usted puede filtrar los eventos de varias maneras. Usa filtros para selectar un campo de fecha, exponer estos filtros para habilitar los visitantes a selectar un campo de fecha, o elimina los filtros y mostra los parámetros del año, mes y dia para filtrar los eventos con el url (i.e. AAAA/MM/DD).</p>

source: now
es: ahora

source: Event: Start Time
es: Event: Hora de comienzo

source: Event: End Time
es: Evento: Hora de terminación

source: Event: Timezone
es: Entrada de zona horaria del evento

source: Event: Start Date
es: Fecha de comienzo.

source: This filter allows events to be filtered by their start date. Enter dates in the format: CCYY-MM-DD HH:MM:SS. Enter 'now' to use the current time. You may enter a delta (in seconds) to the option that will be added to the time; this is most useful when combined with now. If you have the jscalendar module from jstools installed, you can use a popup date picker here.
es: El filtro permite que los eventos estén filtrados por su fecha de fin. Introduzca fechas seguiendo el modelo : CCYY-MM-DD HH:MM:SS. Incribe 'now' para usar la hora en curso. Establecerá un delta (secundos) para la opcion que será añadida al tiempo; eso es más utile cuando está combinado con ahora. Si usted tiene el módulo jscalendar de jstools intalado, puede usar un popup recolector de fecha aquí.

source: Event: End Date
es: Evento : Fecha final

source: This filter allows events to be filtered by their end date. Enter dates in the format: CCYY-MM-DD HH:MM:SS. Enter 'now' to use the current time. You may enter a delta (in seconds) to the option that will be added to the time; this is most useful when combined with now. If you have the jscalendar module from jstools installed, you can use a popup date picker here.
es: El filtro permite que los eventos estén filtrados por su fecha de comienzo. Introduzca fechas siguiendo el ejemplo : AAAA-MM-DD HH:MM:SS. Inscribe 'ahora' para usar la hora en curso. Establecerá un delta (secundos) al opción que será añadida al tiempo ; esto es más utile cuando está combinado con ahora. Si usted tiene el jscalendar módulo de jstools instalado, puede usar un popup recolector de fecha aquí.

source: Event: Start Year
es: Evento: Año de comienzo

source: Filter by year. Use the option to select the date field to filter on.
es: Filtrar por año. Usa esta opción para seleccionar el campo de fecha que quiere filtrar.

source: Event: Start Month
es: Evento: Mes de comienzo

source: Filter by month. Use the option to select the date field to filter on.
es: Filtrar por mes. Usa esta opción para seleccionar el campo de fecha que quiere filtrar.

source: Event: Start Day
es: Evento: Día de comienzo

source: Filter by day. Use the option to select the date field to filter on.
es: Filtrar por día. Usa esta opción para seleccionar el campo de fecha que quiere filtrar.

source: Event: Type
es: Evento : Tipo

source: A node type selector that is limited to event-enabled node types. Use as exposed filter that only contains event node types.
es: Un selector de tipo nodo que está limitado al tipo de nodo de evento activados. Usa como un filtro que contiene solamente nodos de tipo evento.

source: Event: Start Week
es: Evento : Semana de comienzo

source: Week
es: Semana

source: N/A
es: N/D

source: Events list filtered by drop-down date selector.
es: Lista de eventos filtrada por un selector de fecha

source: event list
es: lista de los eventos

source: Start Time:
es: Fecha de comienzo:

source: End Time:
es: Fecha final:

source: Start Year:
es: Año del comienzo :

source: Start Month:
es: Mes del comienzo :

source: Start Day:
es: Día del comienzo :

source: Events list filtered by js date selector.
es: Lista de eventos filtrada con el selector js date

source: Start Date
es: Fecha de comienzo

source: End Date
es: Fecha de fin.

source: Events list filtered by url arguments.
es: La lista de eventos filtrada pos parámetros url.

source: Year
es: Año

source: Month
es: Mes

source: Day
es: Día
